Taxi/test_billing_fin_payouts/cron/static/test_read_fresh_data/expenses_static_data_expected_filter_client_by_id.json

[
  {
    "accounting_date": "2021-11-18",
    "amount": "1329.00",
    "amount_tlog": "1329.0000",
    "client_id": "69896727",
    "contract_id": "1119640",
    "currency": "RUB",
    "dry_run": true,
    "external_ref": "DEFAULT",
    "id": 1,
    "payload": {
      "agglomeration": "SOCc",
      "alias_id": "49fd612c49722129b33e4c7bc4fb0ac1",
      "contract_info": {
        "alias": "CONTRACT_ALIAS",
        "country_geo": 225,
        "firm_id": 13,
        "link_contract_id": 123457,
        "netting_flag": 1,
        "person_id": 123
      },
      "detailed_product": "park_b2b_trip_payment",
      "driver_details": {
        "db_id": "d3a17a869d7f45da9ac4f1cc8da47bd2",
        "uuid": "a6b432b733ee4f08e2cc90f9eda7f66b"
      },
      "event_time": "2021-11-18T12:28:48.925451+00:00",
      "invoice_date": "2021-11-18T12:28:47.521000+00:00",
      "product": "delivery_park_b2b_trip_payment",
      "service_id": 651,
      "tariff_class": "express",
      "transaction_time": "2021-11-18T12:29:00.201113+00:00",
      "transaction_type": "payment"
    },
    "row_index": 1,
    "status_code": "WITHOUT_NETTING",
    "table_name": "2021-11-18"
  },
  {
    "accounting_date": "2021-11-18",
    "amount": "362.00",
    "amount_tlog": "362.0000",
    "client_id": "25147782",
    "contract_id": "679558",
    "currency": "RUB",
    "dry_run": true,
    "external_ref": "DEFAULT",
    "id": 2,
    "payload": {
      "agglomeration": "NNOc",
      "alias_id": "3568265e45b4d693ba6238b042455e44",
      "contract_info": {
        "alias": "CONTRACT_ALIAS",
        "country_geo": 225,
        "firm_id": 13,
        "link_contract_id": 123457,
        "netting_flag": 1,
        "person_id": 123
      },
      "detailed_product": "park_b2b_trip_payment",
      "driver_details": {
        "db_id": "cb6cfb1ef0ca4546b3a787b75e4e6e24",
        "uuid": "7c1735118e4a4ca499434e91f4fafd37"
      },
      "event_time": "2021-11-18T12:28:48.506063+00:00",
      "invoice_date": "2021-11-18T12:28:46.859000+00:00",
      "product": "delivery_park_b2b_trip_payment",
      "service_id": 651,
      "tariff_class": "express",
      "transaction_time": "2021-11-18T12:29:00.203016+00:00",
      "transaction_type": "payment"
    },
    "row_index": 2,
    "status_code": "WITHOUT_NETTING",
    "table_name": "2021-11-18"
  }
]
