Taxi/test_billing_fin_payouts/cron/static/test_read_fresh_data/expenses_static_data_expected_filter_client_by_mod.json

[
  {
    "accounting_date": "2021-11-18",
    "amount": "336.00",
    "amount_tlog": "336.0000",
    "client_id": "95349520",
    "contract_id": "4134281",
    "currency": "RUB",
    "dry_run": true,
    "external_ref": "DEFAULT",
    "id": 1,
    "payload": {
      "agglomeration": "MSKc",
      "alias_id": "4cfe398558a424f1a79da4f7ec406f78",
      "contract_info": {
        "alias": "CONTRACT_ALIAS",
        "country_geo": 225,
        "firm_id": 13,
        "link_contract_id": 123457,
        "netting_flag": 1,
        "person_id": 123
      },
      "detailed_product": "multi_park_b2b_trip_payment",
      "driver_details": {
        "db_id": "f0167d621a4b4bdfbb7180d5de5e98bf",
        "uuid": "785a270376a87cd5a5a5c32da27f6f44"
      },
      "event_time": "2021-11-18T12:28:53.962494+00:00",
      "invoice_date": "2021-11-18T12:28:52.017000+00:00",
      "product": "delivery_park_b2b_trip_payment",
      "service_id": 651,
      "tariff_class": "courier",
      "transaction_time": "2021-11-18T12:29:00.187335+00:00",
      "transaction_type": "payment"
    },
    "row_index": 0,
    "status_code": "WITHOUT_NETTING",
    "table_name": "2021-11-18"
  },
  {
    "accounting_date": "2021-11-18",
    "amount": "-54.0300",
    "amount_tlog": "54.0300",
    "client_id": "95739425",
    "contract_id": "4327811",
    "currency": "KZT",
    "dry_run": true,
    "external_ref": null,
    "id": 2,
    "payload": {
      "agglomeration": "ALM",
      "alias_id": "0daac3dbee61dc2c957b2a2bb7018b11",
      "detailed_product": "subsidy_commission",
      "driver_details": {
        "db_id": "3af269cf0953468e9155f23ea0d3e9a0",
        "uuid": "8a6495f2863c4a7d932493d902071317"
      },
      "event_time": "2021-11-18T12:28:53.823741+00:00",
      "invoice_date": "2021-11-18T12:28:50.198000+00:00",
      "product": "subsidy",
      "service_id": 137,
      "tariff_class": "uberx",
      "transaction_time": "2021-11-18T12:29:00.326424+00:00",
      "transaction_type": "refund"
    },
    "row_index": 3,
    "status_code": "IGNORE",
    "table_name": "2021-11-18"
  },
  {
    "accounting_date": "2021-11-18",
    "amount": "360.0000",
    "amount_tlog": "360.0000",
    "client_id": "95739425",
    "contract_id": "4327811",
    "currency": "KZT",
    "dry_run": true,
    "external_ref": null,
    "id": 3,
    "payload": {
      "agglomeration": "ALM",
      "alias_id": "0daac3dbee61dc2c957b2a2bb7018b11",
      "detailed_product": "subsidy_mfg_geo",
      "driver_details": {
        "db_id": "3af269cf0953468e9155f23ea0d3e9a0",
        "uuid": "8a6495f2863c4a7d932493d902071317"
      },
      "event_time": "2021-11-18T12:28:53.823741+00:00",
      "invoice_date": "2021-11-18T12:28:50.198000+00:00",
      "product": "subsidy",
      "service_id": 137,
      "tariff_class": "uberx",
      "transaction_time": "2021-11-18T12:29:00.326424+00:00",
      "transaction_type": "payment"
    },
    "row_index": 4,
    "status_code": "TEST",
    "table_name": "2021-11-18"
  }
]
