Taxi/test_billing_fin_payouts/stq/static/test_process_tlog_transactions/expenses_static_data_expected.json

[
  {
    "accounting_date": "2021-11-18",
    "amount": "336.00",
    "amount_tlog": "336.0000",
    "client_id": "95349520",
    "contract_id": "4134281",
    "currency": "RUB",
    "dry_run": false,
    "external_ref": "EMPTY_ALIAS",
    "id": 1,
    "payload": {
      "agglomeration": "MSKc",
      "alias_id": "4cfe398558a424f1a79da4f7ec406f78",
      "contract_info": {
        "alias": "CONTRACT_ALIAS",
        "country_geo": 225,
        "firm_id": 13,
        "link_contract_id": 123457,
        "netting_flag": 1,
        "person_id": 123
      },
      "detailed_product": "multi_park_b2b_trip_payment",
      "driver_details": {
        "db_id": "f0167d621a4b4bdfbb7180d5de5e98bf",
        "uuid": "785a270376a87cd5a5a5c32da27f6f44"
      },
      "event_time": "2021-11-18T12:28:53.962494+00:00",
      "invoice_date": "2021-11-18T12:28:52.017000+00:00",
      "product": "delivery_park_b2b_trip_payment",
      "service_id": 651,
      "target": "fin-payouts/ya-bank",
      "tariff_class": "courier",
      "transaction_time": "2021-11-18T12:29:00.187335+00:00",
      "transaction_type": "payment"
    },
    "payment_processor": "YA_BANK",
    "row_index": null,
    "status_code": "WITHOUT_NETTING",
    "status_msg": null,
    "table_name": "2022-05-25",
    "transaction_id": 1
  },
  {
    "accounting_date": "2021-11-18",
    "amount": "1329.00",
    "amount_tlog": "1329.0000",
    "client_id": "69896727",
    "contract_id": "1119640",
    "currency": "RUB",
    "dry_run": false,
    "external_ref": "EMPTY_ALIAS",
    "id": 2,
    "payload": {
      "agglomeration": "SOCc",
      "alias_id": "49fd612c49722129b33e4c7bc4fb0ac1",
      "contract_info": {
        "alias": "CONTRACT_ALIAS",
        "country_geo": 225,
        "firm_id": 13,
        "link_contract_id": 123457,
        "netting_flag": 1,
        "person_id": 123
      },
      "detailed_product": "park_b2b_trip_payment",
      "driver_details": {
        "db_id": "d3a17a869d7f45da9ac4f1cc8da47bd2",
        "uuid": "a6b432b733ee4f08e2cc90f9eda7f66b"
      },
      "event_time": "2021-11-18T12:28:48.925451+00:00",
      "invoice_date": "2021-11-18T12:28:47.521000+00:00",
      "product": "delivery_park_b2b_trip_payment",
      "service_id": 651,
      "target": "fin-payouts/ya-bank",
      "tariff_class": "express",
      "transaction_time": "2021-11-18T12:29:00.201113+00:00",
      "transaction_type": "payment"
    },
    "payment_processor": "YA_BANK",
    "row_index": null,
    "status_code": "WITHOUT_NETTING",
    "status_msg": null,
    "table_name": "2022-05-25",
    "transaction_id": 2
  },
  {
    "accounting_date": "2021-11-18",
    "amount": "362.00",
    "amount_tlog": "362.0000",
    "client_id": "25147782",
    "contract_id": "679558",
    "currency": "RUB",
    "dry_run": false,
    "external_ref": "EMPTY_ALIAS",
    "id": 3,
    "payload": {
      "agglomeration": "NNOc",
      "alias_id": "3568265e45b4d693ba6238b042455e44",
      "contract_info": {
        "alias": "CONTRACT_ALIAS",
        "country_geo": 225,
        "firm_id": 13,
        "link_contract_id": 123457,
        "netting_flag": 1,
        "person_id": 123
      },
      "detailed_product": "park_b2b_trip_payment",
      "driver_details": {
        "db_id": "cb6cfb1ef0ca4546b3a787b75e4e6e24",
        "uuid": "7c1735118e4a4ca499434e91f4fafd37"
      },
      "event_time": "2021-11-18T12:28:48.506063+00:00",
      "invoice_date": "2021-11-18T12:28:46.859000+00:00",
      "product": "delivery_park_b2b_trip_payment",
      "service_id": 651,
      "target": "fin-payouts/ya-bank",
      "tariff_class": "express",
      "transaction_time": "2021-11-18T12:29:00.203016+00:00",
      "transaction_type": "payment"
    },
    "payment_processor": "YA_BANK",
    "row_index": null,
    "status_code": "WITHOUT_NETTING",
    "status_msg": null,
    "table_name": "2022-05-25",
    "transaction_id": 3
  },
  {
    "accounting_date": "2021-11-18",
    "amount": "360.00",
    "amount_tlog": "360.0000",
    "client_id": "95739425",
    "contract_id": "4327811",
    "currency": "KZT",
    "dry_run": false,
    "external_ref": "EMPTY_ALIAS",
    "id": 4,
    "payload": {
      "agglomeration": "ALM",
      "alias_id": "0daac3dbee61dc2c957b2a2bb7018b11",
      "contract_info": {
        "alias": "CONTRACT_ALIAS",
        "country_geo": 225,
        "firm_id": 13,
        "link_contract_id": 123457,
        "netting_flag": 1,
        "person_id": 123
      },
      "detailed_product": "subsidy_mfg_geo",
      "driver_details": {
        "db_id": "3af269cf0953468e9155f23ea0d3e9a0",
        "uuid": "8a6495f2863c4a7d932493d902071317"
      },
      "event_time": "2021-11-18T12:28:53.823741+00:00",
      "invoice_date": "2021-11-18T12:28:50.198000+00:00",
      "product": "subsidy",
      "service_id": 137,
      "target": "fin-payouts/ya-bank",
      "tariff_class": "uberx",
      "transaction_time": "2021-11-18T12:29:00.326424+00:00",
      "transaction_type": "payment"
    },
    "payment_processor": "YA_BANK",
    "row_index": null,
    "status_code": "WITHOUT_NETTING",
    "status_msg": null,
    "table_name": "2022-05-25",
    "transaction_id": 5
  },
  {
    "accounting_date": "2021-11-18",
    "amount": "360.00",
    "amount_tlog": "360.0000",
    "client_id": "95739425",
    "contract_id": "4327811",
    "currency": "KZT",
    "dry_run": false,
    "external_ref": "EMPTY_ALIAS",
    "id": 5,
    "payload": {
      "agglomeration": "ALM",
      "alias_id": "0daac3dbee61dc2c957b2a2bb7018b11",
      "contract_info": {
        "alias": "CONTRACT_ALIAS",
        "country_geo": 225,
        "firm_id": 13,
        "link_contract_id": 123457,
        "netting_flag": 1,
        "person_id": 123
      },
      "detailed_product": "subsidy_mfg_geo",
      "driver_details": {
        "db_id": "3af269cf0953468e9155f23ea0d3e9a0",
        "uuid": "8a6495f2863c4a7d932493d902071317"
      },
      "event_time": "2021-11-18T12:28:53.823741+00:00",
      "invoice_date": "2021-11-18T12:28:50.198000+00:00",
      "product": "product_with_contract_info",
      "service_id": 137,
      "target": "fin-payouts/ya-bank",
      "tariff_class": "uberx",
      "transaction_time": "2021-11-18T12:29:00.326424+00:00",
      "transaction_type": "payment"
    },
    "payment_processor": "YA_BANK",
    "row_index": null,
    "status_code": "WITHOUT_NETTING",
    "status_msg": null,
    "table_name": "2022-05-25",
    "transaction_id": 6
  }
]
