Taxi/test_billing_fin_payouts/stq/static/test_process_tlog_transactions_accruals_pmt/payments_static_data_expected.json

[
  {
    "accounting_date": "2021-11-18",
    "amount": "102.00",
    "amount_tlog": "102.0000",
    "client_id": "56579731",
    "contract_id": "676914",
    "currency": "RUB",
    "dry_run": true,
    "id": 1,
    "payload": {
      "agglomeration": "YOSc",
      "alias_id": "0be1e294a9082ce296c62d7ff95919b8",
      "contract_info": {
        "alias": "CONTRACT_ALIAS",
        "country_geo": 225,
        "firm_id": 13,
        "link_contract_id": 123457,
        "netting_flag": 1,
        "person_id": 123
      },
      "country_netting_flag": true,
      "detailed_product": "trip_payment",
      "driver_details": {
        "db_id": "45087309a4d4417b8e9c5348e0f38159",
        "uuid": "13472011e73f563628a075748ea6500e"
      },
      "event_time": "2021-11-18T17:05:30.377000+03:00",
      "invoice_date": "2021-11-18T14:05:16.175000+03:00",
      "product": "trip_compensation",
      "service_id": 124,
      "tariff_class": "econom",
      "terminal_id": 57000589,
      "transaction_time": "2021-11-18T14:06:47.719786+00:00",
      "transaction_type": "payment"
    },
    "row_index": null,
    "status_code": "WITH_NETTING",
    "status_msg": null,
    "table_name": "2022-05-25",
    "transaction_id": 14341732235
  },
  {
    "accounting_date": "2021-11-02",
    "amount": "-10.00",
    "amount_tlog": "-10.0000",
    "client_id": "61092938",
    "contract_id": "808972",
    "currency": "BYN",
    "dry_run": true,
    "id": 2,
    "payload": {
      "agglomeration": "MNKc",
      "alias_id": "a7e5e09ae1613f74a946cf1e1aa0efba",
      "contract_info": {
        "alias": "CONTRACT_ALIAS",
        "country_geo": 225,
        "firm_id": 13,
        "link_contract_id": 123457,
        "netting_flag": 1,
        "person_id": 123
      },
      "country_netting_flag": false,
      "detailed_product": "trip_payment",
      "driver_details": {
        "db_id": "9b9d0d9ed1ad47388f91b357086edf71",
        "uuid": "51e146868df3beea5e264e86a7e4c2cf"
      },
      "event_time": "2021-11-02T00:00:00+03:00",
      "invoice_date": "2021-10-31T01:08:28.706000+03:00",
      "product": "trip_payment",
      "service_id": 125,
      "tariff_class": "uberx",
      "terminal_id": 55411503,
      "transaction_time": "2021-11-18T14:06:47.712514+00:00",
      "transaction_type": "refund"
    },
    "row_index": null,
    "status_code": "WITHOUT_NETTING",
    "status_msg": null,
    "table_name": "2022-05-25",
    "transaction_id": 14341732236
  },
  {
    "accounting_date": "2021-11-18",
    "amount": "128.00",
    "amount_tlog": "128.0000",
    "client_id": "94636168",
    "contract_id": "3830002",
    "currency": "RUB",
    "dry_run": true,
    "id": 3,
    "payload": {
      "agent_id": "agent_psb",
      "agglomeration": "TOLc",
      "alias_id": "b8c2e55c99d63fb8baad68126ac015d9",
      "contract_info": {
        "alias": "CONTRACT_ALIAS",
        "country_geo": 225,
        "firm_id": 13,
        "link_contract_id": 123457,
        "netting_flag": 1,
        "person_id": 123
      },
      "country_netting_flag": true,
      "detailed_product": "trip_payment",
      "driver_details": {
        "db_id": "52bb810a6e204ca38b20c001525c2d43",
        "uuid": "cf40cb413700fd98891c633cae648629"
      },
      "event_time": "2021-11-18T17:05:30.523000+03:00",
      "invoice_date": "2021-11-18T14:13:26.540000+03:00",
      "product": "trip_payment",
      "service_id": 124,
      "tariff_class": "econom",
      "transaction_time": "2021-11-18T14:06:47.739575+00:00",
      "transaction_type": "payment"
    },
    "row_index": null,
    "status_code": "WITH_NETTING",
    "status_msg": null,
    "table_name": "2022-05-25",
    "transaction_id": 14341732241
  },
  {
    "accounting_date": "2021-11-18",
    "amount": "252.00",
    "amount_tlog": "252.0000",
    "client_id": "37904064",
    "contract_id": "317971",
    "currency": "RUB",
    "dry_run": true,
    "id": 4,
    "payload": {
      "agglomeration": "KJAc",
      "alias_id": "f0fc69e9c31ed0069301cf9056d84119",
      "contract_info": {
        "alias": "CONTRACT_ALIAS",
        "country_geo": 225,
        "firm_id": 13,
        "link_contract_id": 123457,
        "netting_flag": 1,
        "person_id": 123
      },
      "country_netting_flag": true,
      "detailed_product": "trip_payment",
      "driver_details": {
        "db_id": "a88e926315b149d98bc7939d24df7932",
        "uuid": "263f6cf986f217025dff495a222c43c4"
      },
      "event_time": "2021-11-18T17:05:30.079000+03:00",
      "invoice_date": "2021-11-18T14:22:36.044000+03:00",
      "product": "trip_payment",
      "service_id": 124,
      "tariff_class": "econom",
      "terminal_id": 57000589,
      "transaction_time": "2021-11-18T14:06:47.745324+00:00",
      "transaction_type": "payment"
    },
    "row_index": null,
    "status_code": "WITH_NETTING",
    "status_msg": null,
    "table_name": "2022-05-25",
    "transaction_id": 14341732245
  },
  {
    "accounting_date": "2021-11-18",
    "amount": "864.52",
    "amount_tlog": "865.0000",
    "client_id": "92907586",
    "contract_id": "3050589",
    "currency": "RUB",
    "dry_run": true,
    "id": 5,
    "payload": {
      "agglomeration": "MSKc",
      "alias_id": "b3c25fc446aa171c87564e6c91232b29",
      "contract_info": {
        "alias": "CONTRACT_ALIAS",
        "country_geo": 225,
        "firm_id": 13,
        "link_contract_id": 123457,
        "netting_flag": 1,
        "person_id": 123
      },
      "country_netting_flag": true,
      "detailed_product": "trip_payment",
      "driver_details": {
        "db_id": "b0b2e8d27e90441bb38fa9a7c8e860b7",
        "uuid": "fa8cf72ffd4f492a454ca6fc7dc73fd0"
      },
      "event_time": "2021-11-18T17:05:30.504000+03:00",
      "invoice_date": "2021-11-18T14:05:13.896000+03:00",
      "product": "trip_payment",
      "service_id": 124,
      "tariff_class": "express",
      "terminal_id": 57000417,
      "transaction_time": "2021-11-18T14:06:47.761548+00:00",
      "transaction_type": "payment",
      "yandex_reward_allow_flag": true,
      "yandex_reward_amt": "0.48",
      "yandex_reward_product": "yandex_amt_reward"
    },
    "row_index": null,
    "status_code": "WITH_NETTING",
    "status_msg": null,
    "table_name": "2022-05-25",
    "transaction_id": 14341732247
  }
]
