Taxi/test_billing_fin_payouts/stq/static/test_process_tlog_transactions_rev_oebs_skip/revenues_static_data_expected.json

[
  {
    "accounting_date": "2021-11-18",
    "amount": "47.82",
    "amount_tlog": "40.5280",
    "client_id": "39420794",
    "contract_id": "330904",
    "currency": "RUB",
    "dry_run": false,
    "external_ref": "DEFAULT",
    "id": 1,
    "payload": {
      "account_info": {
        "account": "ЛСТ-12345678",
        "account_type": "YANDEX_SERVICE"
      },
      "agglomeration": "KRRc",
      "alias_id": "c5664b954607cdae9963c412df06851e",
      "contract_info": {
        "alias": "CONTRACT_ALIAS",
        "country_geo": 225,
        "firm_id": 13,
        "link_contract_id": 123457,
        "netting_flag": 0,
        "person_id": 123
      },
      "country_netting_flag": true,
      "detailed_product": "gross_commission_trips",
      "driver_details": {
        "db_id": "bb8a757b12e54dfdbf23708ab31e0151",
        "uuid": "df1ea215307c87f035f1ada1deec23da"
      },
      "event_time": "2021-11-18T06:16:20.497654+00:00",
      "invoice_date": "2021-11-18T06:16:17.000000+00:00",
      "product": "order",
      "service_id": 128,
      "target": "fin-payouts/oebs",
      "tariff_class": "econom",
      "transaction_time": "2021-11-18T06:16:27.036461+00:00",
      "transaction_type": "payment",
      "vat_rate": "18.00"
    },
    "payment_processor": "OEBS",
    "row_index": null,
    "status_code": "SKIP_PAYOUT",
    "status_msg": null,
    "table_name": "2022-05-25",
    "transaction_id": 14328766188
  }
]
